================================================================================
ATX heading level 1
================================================================================

# H1

--------------------------------------------------------------------------------

(source_file
  (heading
    (heading_marker)
    (heading_text
      (text))))

================================================================================
ATX heading level 2
================================================================================

## H2

--------------------------------------------------------------------------------

(source_file
  (heading
    (heading_marker)
    (heading_text
      (text))))

================================================================================
ATX heading level 3
================================================================================

### H3

--------------------------------------------------------------------------------

(source_file
  (heading
    (heading_marker)
    (heading_text
      (text))))

================================================================================
ATX heading levels 4-6
================================================================================

#### H4

##### H5

###### H6

--------------------------------------------------------------------------------

(source_file
  (heading
    (heading_marker)
    (heading_text
      (text)))
  (heading
    (heading_marker)
    (heading_text
      (text)))
  (heading
    (heading_marker)
    (heading_text
      (text))))

================================================================================
Heading with trailing space
================================================================================

# Title

--------------------------------------------------------------------------------

(source_file
  (heading
    (heading_marker)
    (heading_text
      (text))))

================================================================================
Heading without space after marker (invalid)
================================================================================

#No space
This is a paragraph

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (text)))

================================================================================
Simple paragraph
================================================================================

This is a simple paragraph.

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)))

================================================================================
Paragraph with multiple lines
================================================================================

Line one
Line two
Line three

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (text)
    (text)))

================================================================================
Paragraph with inline expression line start
================================================================================

Line one
{% $name %} continues here

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (inline_expression
      (inline_expression_open)
      (variable_value
        (variable_reference
          (variable
            (identifier))))
      (inline_expression_close))
    (text)))

================================================================================
Two paragraphs separated by blank line
================================================================================

First paragraph
on multiple lines.

Second paragraph here.

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (text))
  (paragraph
    (text)))

================================================================================
Heading followed by paragraph
================================================================================

# Title

Paragraph below heading.

--------------------------------------------------------------------------------

(source_file
  (heading
    (heading_marker)
    (heading_text
      (text)))
  (paragraph
    (text)))

================================================================================
Heading with annotation
================================================================================

# foo {% width='200%' %}

--------------------------------------------------------------------------------

(source_file
  (heading
    (heading_marker)
    (heading_text
      (text)
      (annotation
        (annotation_block
          (inline_expression_open)
          (annotation_name
            (tag_identifier))
          (annotation_value
            (value_expression
              (json_value
                (string))))
          (inline_expression_close))))))

================================================================================
Heading with object annotation
================================================================================

# meta {% info={foo: "bar"} %}

--------------------------------------------------------------------------------

(source_file
  (heading
    heading_marker: (heading_marker)
    heading_text: (heading_text
      (text)
      (annotation
        (annotation_block
          (inline_expression_open)
          (annotation_name
            (tag_identifier))
          (annotation_value
            (value_expression
              (json_value
                (object_literal
                  (pair
                    key: (identifier)
                    value: (json_value
                      (string)))))))
          (inline_expression_close))))))

================================================================================
Heading with shorthand annotation
================================================================================

# hero {% #banner .large .center %}

--------------------------------------------------------------------------------

(source_file
  (heading
    (heading_marker)
    (heading_text
      (text)
      (annotation
        (annotation_block
          (inline_expression_open)
          (id_shorthand
            (shorthand_id))
          (class_shorthand
            (shorthand_class))
          (class_shorthand
            (shorthand_class))
          (inline_expression_close))))))

================================================================================
Mixed headings and paragraphs
================================================================================

# Main Title

Introduction paragraph.

## Section One

Content for section one.

### Subsection

More detailed content.

## Section Two

Final paragraph.

--------------------------------------------------------------------------------

(source_file
  (heading
    (heading_marker)
    (heading_text
      (text)))
  (paragraph
    (text))
  (heading
    (heading_marker)
    (heading_text
      (text)))
  (paragraph
    (text))
  (heading
    (heading_marker)
    (heading_text
      (text)))
  (paragraph
    (text))
  (heading
    (heading_marker)
    (heading_text
      (text)))
  (paragraph
    (text)))

================================================================================
Heading with frontmatter
================================================================================
---
title: Document
---

# Heading

Content here.

--------------------------------------------------------------------------------

(source_file
  (frontmatter
    (yaml))
  (heading
    (heading_marker)
    (heading_text
      (text)))
  (paragraph
    (text)))
