================================================================================
ATX heading level 1
================================================================================

# H1

--------------------------------------------------------------------------------

(source_file
  (heading
    (heading_marker)
    (heading_text)))

================================================================================
ATX heading level 2
================================================================================

## H2

--------------------------------------------------------------------------------

(source_file
  (heading
    (heading_marker)
    (heading_text)))

================================================================================
ATX heading level 3
================================================================================

### H3

--------------------------------------------------------------------------------

(source_file
  (heading
    (heading_marker)
    (heading_text)))

================================================================================
ATX heading levels 4-6
================================================================================

#### H4

##### H5

###### H6

--------------------------------------------------------------------------------

(source_file
  (heading
    (heading_marker)
    (heading_text))
  (heading
    (heading_marker)
    (heading_text))
  (heading
    (heading_marker)
    (heading_text)))

================================================================================
Heading with trailing space
================================================================================

# Title

--------------------------------------------------------------------------------

(source_file
  (heading
    (heading_marker)
    (heading_text)))

================================================================================
Heading without space after marker (invalid)
================================================================================

#No space
This is a paragraph

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (text)))

================================================================================
Simple paragraph
================================================================================

This is a simple paragraph.

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)))

================================================================================
Paragraph with multiple lines
================================================================================

Line one
Line two
Line three

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (text)
    (text)))

================================================================================
Paragraph with inline expression line start
================================================================================

Line one
{% $name %} continues here

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (inline_expression
      (tag_open_delimiter)
      (variable_value
        (variable_reference
          (variable
            (identifier))))
      (inline_expression_close))
    (text)))

================================================================================
Two paragraphs separated by blank line
================================================================================

First paragraph
on multiple lines.

Second paragraph here.

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (text))
  (paragraph
    (text)))

================================================================================
Heading followed by paragraph
================================================================================

# Title

Paragraph below heading.

--------------------------------------------------------------------------------

(source_file
  (heading
    (heading_marker)
    (heading_text))
  (paragraph
    (text)))

================================================================================
Mixed headings and paragraphs
================================================================================

# Main Title

Introduction paragraph.

## Section One

Content for section one.

### Subsection

More detailed content.

## Section Two

Final paragraph.

--------------------------------------------------------------------------------

(source_file
  (heading
    (heading_marker)
    (heading_text))
  (paragraph
    (text))
  (heading
    (heading_marker)
    (heading_text))
  (paragraph
    (text))
  (heading
    (heading_marker)
    (heading_text))
  (paragraph
    (text))
  (heading
    (heading_marker)
    (heading_text))
  (paragraph
    (text)))

================================================================================
Heading with frontmatter
================================================================================
---
title: Document
---

# Heading

Content here.

--------------------------------------------------------------------------------

(source_file
  (frontmatter
    (yaml))
  (heading
    (heading_marker)
    (heading_text))
  (paragraph
    (text)))
