=============================================================================
Variable references in inline expressions
=============================================================================

{% $user.name %}

-----------------------------------------------------------------------------

(source_file
  (paragraph
    (inline_expression
      (tag_open_delimiter)
      (variable_value
        (variable_reference
          (variable
            (identifier))
          (identifier)))
      (inline_expression_close))))

=============================================================================
Special variables in inline expressions
=============================================================================

{% @index %}

-----------------------------------------------------------------------------

(source_file
  (paragraph
    (inline_expression
      (tag_open_delimiter)
      (variable_value
        (special_variable_reference
          (special_variable
            (identifier))))
      (inline_expression_close))))

=============================================================================
Subscript variables in inline expressions
=============================================================================

{% $items[0] %}

-----------------------------------------------------------------------------

(source_file
  (paragraph
    (inline_expression
      (tag_open_delimiter)
      (variable_value
        (subscript_reference
          (variable_reference
            (variable
              (identifier)))
          (array_subscript
            (number))))
      (inline_expression_close))))

=============================================================================
Function calls in inline expressions
=============================================================================

{% formatDate($date) %}

-----------------------------------------------------------------------------

(source_file
  (paragraph
    (inline_expression
      (tag_open_delimiter)
      (call_expression
        (identifier)
        (value_expression
          (variable_value
            (variable_reference
              (variable
                (identifier))))))
      (inline_expression_close))))

=============================================================================
Attribute values with literals
=============================================================================

{% card title="Welcome" count=5 featured=true /%}

-----------------------------------------------------------------------------

(source_file
  (markdoc_tag
    (tag_self_close
      (tag_open_delimiter)
      (tag_name)
      (attribute
        (attribute_name)
        (attribute_value
          (value_expression
            (json_value
              (string)))))
      (attribute
        (attribute_name)
        (attribute_value
          (value_expression
            (json_value
              (number)))))
      (attribute
        (attribute_name)
        (attribute_value
          (value_expression
            (json_value
              (boolean)))))
      (tag_self_close_delimiter))))

=============================================================================
Attribute values with arrays and objects
=============================================================================

{% data items=[1, 2] meta={id: "id_123"} /%}

-----------------------------------------------------------------------------

(source_file
  (markdoc_tag
    (tag_self_close
      (tag_open_delimiter)
      (tag_name)
      (attribute
        (attribute_name)
        (attribute_value
          (value_expression
            (json_value
              (array_literal
                (json_value
                  (number))
                (json_value
                  (number)))))))
      (attribute
        (attribute_name)
        (attribute_value
          (value_expression
            (json_value
              (object_literal
                (pair
                  (identifier)
                  (json_value
                    (string))))))))
      (tag_self_close_delimiter))))

=============================================================================
Attribute values with variables and functions
=============================================================================

{% card title=$title subtitle=titleCase($subtitle) index=@index item=$items[0] /%}

-----------------------------------------------------------------------------

(source_file
  (markdoc_tag
    (tag_self_close
      (tag_open_delimiter)
      (tag_name)
      (attribute
        (attribute_name)
        (attribute_value
          (value_expression
            (variable_value
              (variable_reference
                (variable
                  (identifier)))))))
      (attribute
        (attribute_name)
        (attribute_value
          (value_expression
            (call_expression
              (identifier)
              (value_expression
                (variable_value
                  (variable_reference
                    (variable
                      (identifier)))))))))
      (attribute
        (attribute_name)
        (attribute_value
          (value_expression
            (variable_value
              (special_variable_reference
                (special_variable
                  (identifier)))))))
      (attribute
        (attribute_name)
        (attribute_value
          (value_expression
            (variable_value
              (subscript_reference
                (variable_reference
                  (variable
                    (identifier)))
                (array_subscript
                  (number)))))))
      (tag_self_close_delimiter))))
