=======================================
Variable reference
=======================================

Text {% $user.name %} here.

---

(source_file
  (paragraph
    (text)
    (inline_expression
      (inline_expression_open)
      (variable_value
        (variable_reference
          (variable
            (identifier))
          (identifier)))
      (inline_expression_close))
    (text)))

=======================================
Nested variable reference
=======================================

Value is {% $obj.prop.nested %}.

---

(source_file
  (paragraph
    (text)
    (inline_expression
      (inline_expression_open)
      (variable_value
        (variable_reference
          (variable
            (identifier))
          (identifier)
          (identifier)))
      (inline_expression_close))
    (text)))

=======================================
Special variable reference
=======================================

Index {% @index %} here.

---

(source_file
  (paragraph
    (text)
    (inline_expression
      (inline_expression_open)
      (variable_value
        (special_variable_reference
          (special_variable
            (identifier))))
      (inline_expression_close))
    (text)))

=======================================
Subscript reference
=======================================

Item {% $items[0] %} end.

---

(source_file
  (paragraph
    (text)
    (inline_expression
      (inline_expression_open)
      (variable_value
        (subscript_reference
          (variable_reference
            (variable
              (identifier)))
          (array_subscript
            (number))))
      (inline_expression_close))
    (text)))

=======================================
Function call with literal argument
=======================================

Value {% formatDate("2024-01-01") %} end.

---

(source_file
  (paragraph
    (text)
    (inline_expression
      (inline_expression_open)
      (inline_call_expression
        (function_identifier)
        (value_expression
          (json_value
            (string))))
      (inline_expression_close))
    (text)))

=======================================
Function call with variable argument
=======================================

Output {% titleCase($user.name) %} text.

---

(source_file
  (paragraph
    (text)
    (inline_expression
      (inline_expression_open)
      (inline_call_expression
        (function_identifier)
        (value_expression
          (variable_value
            (variable_reference
              (variable
                (identifier))
              (identifier)))))
      (inline_expression_close))
    (text)))
