=============================================================================
Inline annotations
=============================================================================

Text {% width value="25%" /%} more text.

-----------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (inline_tag
      (tag_open)
      (tag_name)
      (attribute
        (attribute_name)
        (attribute_value
          (value_expression
            (json_value
              (string)))))
      (tag_self_close_delimiter))
    (text)))

=============================================================================
Inline annotation on its own line
=============================================================================

Line one
{% width value="25%" /%}
Line three

-----------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (inline_tag
      (tag_open)
      (tag_name)
      (attribute
        (attribute_name)
        (attribute_value
          (value_expression
            (json_value
              (string)))))
      (tag_self_close_delimiter))
    (text)))

=============================================================================
Inline variable tag
=============================================================================

Hello {% $markdoc.frontmatter.title %}.

-----------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (inline_expression
      (inline_expression_open)
      content: (variable_value
        (variable_reference
          (variable
            (identifier))
          (identifier)
          (identifier)))
      (inline_expression_close))
    (text)))

=============================================================================
Inline function tag
=============================================================================

Title {% titleCase($markdoc.frontmatter.title) %} here.

-----------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (inline_expression
      (inline_expression_open)
      content: (inline_call_expression
        function: (function_identifier)
        (value_expression
          (variable_value
            (variable_reference
              (variable
                (identifier))
              (identifier)
              (identifier)))))
      (inline_expression_close))
    (text)))
