=============================================================================
Inline annotations
=============================================================================

Text {% width value="25%" /%} more text.

-----------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (inline_tag
      (tag_self_close
        (tag_open_delimiter)
        (tag_name)
        (attribute
          (attribute_name)
          (attribute_value
            (value_expression
              (json_value
                (string)))))
        (tag_self_close_delimiter)))
    (text)))

=============================================================================
Inline annotation on its own line
=============================================================================

Line one
{% width value="25%" /%}
Line three

-----------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (inline_tag
      (tag_self_close
        (tag_open_delimiter)
        (tag_name)
        (attribute
          (attribute_name)
          (attribute_value
            (value_expression
              (json_value
                (string)))))
        (tag_self_close_delimiter)))
    (text)))

=============================================================================
Inline variable tag
=============================================================================

Hello {% $markdoc.frontmatter.title %}.

-----------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (inline_expression
      (tag_open_delimiter)
      content: (variable_value
        (variable_reference
          (variable
            (identifier))
          (identifier)
          (identifier)))
      (inline_expression_close))
    (text)))

=============================================================================
Inline function tag
=============================================================================

Title {% $titleCase($markdoc.frontmatter.title) %} here.

-----------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (inline_expression
      (tag_open_delimiter)
      content: (inline_call_expression
        function: (variable
          (identifier))
        (value_expression
          (variable_value
            (variable_reference
              (variable
                (identifier))
              (identifier)
              (identifier)))))
      (inline_expression_close))
    (text)))
