=======================================
Unordered list with simple annotation
=======================================

- Item one {% type=important %}
- Item two
- Item three

---

(source_file
  (unordered_list
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)))))

=======================================
Ordered list with simple annotation
=======================================

1. First item {% type=note %}
2. Second item
3. Third item

---

(source_file
  (ordered_list
    (ordered_list_item
      (ordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))
    (ordered_list_item
      (ordered_list_marker)
      (list_paragraph
        (text)))
    (ordered_list_item
      (ordered_list_marker)
      (list_paragraph
        (text)))))

=======================================
List with multiple annotations
=======================================

- Item one {% type=important %}
- Item two {% type=warning %}
- Item three {% type=info %}

---

(source_file
  (unordered_list
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))))

=======================================
List with multiple words and annotation
=======================================

- This is important content {% type=highlight %}
- Normal item

---

(source_file
  (unordered_list
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)))))

=======================================
Nested list with annotations
=======================================

- Parent item {% type=important %}
- Child item {% type=note %}
- Another child
- Another parent {% type=warning %}

---

(source_file
  (unordered_list
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))))

=======================================
List item annotation with attributes
=======================================

- Item one {% type=custom type="primary" %}
- Item two

---

(source_file
  (unordered_list
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (attribute
              (attribute_name)
              (attribute_value
                (value_expression
                  (json_value
                    (string)))))
            (inline_expression_close)))))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)))))

=======================================
List annotation with expression attribute
=======================================

- Item one {% type=tag value=$variable %}
- Item two

---

(source_file
  (unordered_list
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (attribute
              (attribute_name)
              (attribute_value
                (value_expression
                  (variable_value
                    (variable_reference
                      (variable
                        (identifier)))))))
            (inline_expression_close)))))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)))))

=======================================
Ordered list with all items annotated
=======================================

1. First {% type=important %}
2. Second {% type=important %}
3. Third {% type=important %}

---

(source_file
  (ordered_list
    (ordered_list_item
      (ordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))
    (ordered_list_item
      (ordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))
    (ordered_list_item
      (ordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))))

=======================================
List with simple text and annotation
=======================================

- Simple text item {% type=highlight %}
- Normal item

---

(source_file
  (unordered_list
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)))))

=======================================
List with text and another word annotation
=======================================

- Item content here {% type=info %}
- Normal item

---

(source_file
  (unordered_list
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)))))

=======================================
Mixed list with and without annotations
=======================================

- Item one {% type=important %}
- Item two
- Item three {% type=warning %}
- Item four

---

(source_file
  (unordered_list
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)))))

=======================================
Ordered list with id shorthand annotation
=======================================

1. Clean room {% #list %}

---

(source_file
  (ordered_list
    (ordered_list_item
      (ordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (id_shorthand
              (shorthand_id))
            (inline_expression_close)))))))

=======================================
Unordered list with class shorthand annotation
=======================================

- Throw out the garbage {% .red %}

---

(source_file
  (unordered_list
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (class_shorthand
              (shorthand_class))
            (inline_expression_close)))))))
