=======================================
Unordered list with simple annotation
=======================================

- Item one {% type=important %}
- Item two
- Item three

---

(source_file
  (unordered_list
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)))))

=======================================
Ordered list with simple annotation
=======================================

1. First item {% type=note %}
2. Second item
3. Third item

---

(source_file
  (ordered_list
    (ordered_list_item
      (ordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))
    (ordered_list_item
      (ordered_list_marker)
      (list_paragraph
        (text)))
    (ordered_list_item
      (ordered_list_marker)
      (list_paragraph
        (text)))))

=======================================
List with multiple annotations
=======================================

- Item one {% type=important %}
- Item two {% type=warning %}
- Item three {% type=info %}

---

(source_file
  (unordered_list
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))))

=======================================
List with multiple words and annotation
=======================================

- This is important content {% type=highlight %}
- Normal item

---

(source_file
  (unordered_list
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)))))

=======================================
Nested list with annotations
=======================================

- Parent item {% type=important %}
- Child item {% type=note %}
- Another child
- Another parent {% type=warning %}

---

(source_file
  (unordered_list
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))))

=======================================
List item annotation with attributes
=======================================

- Item one {% type=custom type="primary" %}
- Item two

---

(source_file
  (unordered_list
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (attribute
              (attribute_name)
              (attribute_value
                (value_expression
                  (json_value
                    (string)))))
            (inline_expression_close)))))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)))))

=======================================
List annotation with expression attribute
=======================================

- Item one {% type=tag value=$variable %}
- Item two

---

(source_file
  (unordered_list
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (attribute
              (attribute_name)
              (attribute_value
                (value_expression
                  (variable_value
                    (variable_reference
                      (variable
                        (identifier)))))))
            (inline_expression_close)))))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)))))

=======================================
Ordered list with all items annotated
=======================================

1. First {% type=important %}
2. Second {% type=important %}
3. Third {% type=important %}

---

(source_file
  (ordered_list
    (ordered_list_item
      (ordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))
    (ordered_list_item
      (ordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))
    (ordered_list_item
      (ordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))))

=======================================
List with simple text and annotation
=======================================

- Simple text item {% type=highlight %}
- Normal item

---

(source_file
  (unordered_list
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)))))

=======================================
List with text and another word annotation
=======================================

- Item content here {% type=info %}
- Normal item

---

(source_file
  (unordered_list
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)))))

=======================================
Mixed list with and without annotations
=======================================

- Item one {% type=important %}
- Item two
- Item three {% type=warning %}
- Item four

---

(source_file
  (unordered_list
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (inline_expression_close)))))
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)))))

=======================================
Ordered list with id shorthand annotation
=======================================

1. Clean room {% #list %}

---

(source_file
  (ordered_list
    (ordered_list_item
      (ordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (id_shorthand
              (shorthand_id))
            (inline_expression_close)))))))

=======================================
Unordered list with class shorthand annotation
=======================================

- Throw out the garbage {% .red %}

---

(source_file
  (unordered_list
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (class_shorthand
              (shorthand_class))
            (inline_expression_close)))))))

=======================================
Ordered list with numeric annotation
=======================================

1. Pack boxes {% order=3 %}

---

(source_file
  (ordered_list
    (ordered_list_item
      (ordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (value_expression
                (json_value
                  (number))))
            (inline_expression_close)))))))

=======================================
Ordered list with boolean annotation
=======================================

1. Toggle feature {% enabled=true %}

---

(source_file
  (ordered_list
    (ordered_list_item
      (ordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (value_expression
                (json_value
                  (boolean))))
            (inline_expression_close)))))))

=======================================
Unordered list with null annotation
=======================================

- No value {% reason=null %}

---

(source_file
  (unordered_list
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (value_expression
                (json_value
                  (null))))
            (inline_expression_close)))))))

=======================================
Unordered list with array annotation
=======================================

- Add tags {% tags=["one", "two"] %}

---

(source_file
  (unordered_list
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (value_expression
                (json_value
                  (array_literal
                    (json_value
                      (string))
                    (json_value
                      (string))))))
            (inline_expression_close)))))))

=======================================
Unordered list with object annotation
=======================================

- Store meta {% meta={role: "admin"} %}

---

(source_file
  (unordered_list
    items: (unordered_list_item
      marker: (unordered_list_marker)
      content: (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (value_expression
                (json_value
                  (object_literal
                    (pair
                      key: (identifier)
                      value: (json_value
                        (string)))))))
            (inline_expression_close)))))))

=======================================
Ordered list with variable annotation
=======================================

1. Use input {% value=$input %}

---

(source_file
  (ordered_list
    (ordered_list_item
      (ordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (value_expression
                (variable_value
                  (variable_reference
                    (variable
                      (identifier))))))
            (inline_expression_close)))))))

=======================================
Ordered list with call annotation
=======================================

1. Compute value {% value=format($input) %}

---

(source_file
  (ordered_list
    items: (ordered_list_item
      marker: (ordered_list_marker)
      content: (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (value_expression
                (call_expression
                  function: (identifier)
                  (value_expression
                    (variable_value
                      (variable_reference
                        (variable
                          (identifier))))))))
            (inline_expression_close)))))))

=======================================
Unordered list with annotation attributes
=======================================

- Item with attrs {% type=note data="x" %}

---

(source_file
  (unordered_list
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (annotation_name
              (tag_identifier))
            (annotation_value
              (identifier))
            (attribute
              (attribute_name)
              (attribute_value
                (value_expression
                  (json_value
                    (string)))))
            (inline_expression_close)))))))

=======================================
Unordered list with multiple shorthands
=======================================

- Classed item {% #primary .wide .highlight %}

---

(source_file
  (unordered_list
    (unordered_list_item
      (unordered_list_marker)
      (list_paragraph
        (text)
        (annotation
          (annotation_block
            (inline_expression_open)
            (id_shorthand
              (shorthand_id))
            (class_shorthand
              (shorthand_class))
            (class_shorthand
              (shorthand_class))
            (inline_expression_close)))))))
